---
kind: method
id: M:Autodesk.Revit.DB.ExportDWGSettings.GetDXFExportOptions
source: html/c678af47-2536-4301-8167-85d1aacf604e.htm
---
# Autodesk.Revit.DB.ExportDWGSettings.GetDXFExportOptions Method

Gets the options stored in the these settings.

## Syntax (C#)
```csharp
public DXFExportOptions GetDXFExportOptions()
```

## Returns
The options